/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: sysperfLib.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2016 年 07 月 28 日
**
** 描        述: 系统性能分析工具.
*********************************************************************************************************/

#ifndef __SYSPERFLIB_H
#define __SYSPERFLIB_H

/*********************************************************************************************************
  性能分析消息结构
*********************************************************************************************************/

typedef struct {
    ULONG                   PERF_ulCPUId;                               /*  CPU ID                      */
    LW_OBJECT_HANDLE        PERF_ulThread;                              /*  线程句柄                    */
    pid_t                   PERF_pid;                                   /*  进程 ID                     */
    addr_t                  PERF_ulAddr;                                /*  执行 PC 指令                */
} LW_SYSPERF_NODE;
typedef LW_SYSPERF_NODE    *PLW_SYSPERF_NODE;

/*********************************************************************************************************
  性能分析运行参数
*********************************************************************************************************/

typedef struct {
    INT                     PERF_iState;                                /*  性能分析是否启动            */
#define LW_SYSPERF_END      0
#define LW_SYSPERF_OFF      1
#define LW_SYSPERF_ON       2
    
    LW_OBJECT_HANDLE        PERF_ulThread;                              /*  信息收集器线程              */
    LW_OBJECT_HANDLE        PERF_ulMsgQ;                                /*  消息                        */
    LW_OBJECT_HANDLE        PERF_ulLock;                                /*  操作锁                      */
    LW_LIST_RING_HEADER     PERF_pringInfo;                             /*  系统信息收集表              */
    UINT                    PERF_ulGetNum;                              /*  获取深度                    */
    PVOID                   PERF_pvBuffer;                              /*  消息缓存                    */
} LW_SYSPERF_PARAM;
typedef LW_SYSPERF_PARAM   *PLW_SYSPERF_PARAM;

/*********************************************************************************************************
  内部函数
*********************************************************************************************************/

PVOID  __sysperfThread(PVOID  pvArg);

#endif                                                                  /*  __SYSPERFLIB_H              */
/*********************************************************************************************************
  END
*********************************************************************************************************/
