/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: arm64VfpV4.h
**
** 创   建   人: Wang.Xuan (王翾)
**
** 文件创建日期: 2018 年 07 月 20 日
**
** 描        述: ARM64 体系架构 VFPv4 支持.
*********************************************************************************************************/

#ifndef __ARM64VFPV4_H
#define __ARM64VFPV4_H

extern UINT32  arm64VfpV4GetFPSR(VOID);
extern VOID    arm64VfpV4SetFPSR(UINT32  uiFPSR);

PARM64_FPU_OP  arm64VfpV4PrimaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);
VOID           arm64VfpV4SecondaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);

#endif                                                                  /*  __ARMV64FPV4_H              */
/*********************************************************************************************************
  END
*********************************************************************************************************/
