/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: CpuHetrcc.c
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2023 年 06 月 06 日
**
** 描        述: SMP 系统异构算力簇.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "../SylixOS/kernel/include/k_kernel.h"
/*********************************************************************************************************
  裁剪控制
*********************************************************************************************************/
#if LW_CFG_SMP_EN > 0
/*********************************************************************************************************
** 函数名称: API_CpuMaxHetrcc
** 功能描述: 获取当前系统最大异构算力簇 ID 号
** 输　入  : NONE
** 输　出  : 最大异构算力簇 ID 号 (编号越大算力越强)
** 全局变量:
** 调用模块:
                                           API 函数
*********************************************************************************************************/
LW_API
ULONG  API_CpuMaxHetrcc (VOID)
{
#if LW_CFG_CPU_ARCH_HETRC > 0
    return  (LW_NHETRCCS);
#else
    return  (0ul);
#endif
}
/*********************************************************************************************************
** 函数名称: API_CpuUpMaxHetrcc
** 功能描述: 获取当前系统在线 CPU 最大异构算力簇 ID 号
** 输　入  : NONE
** 输　出  : 最大异构算力簇 ID 号 (编号越大算力越强)
** 全局变量:
** 调用模块:
                                           API 函数
*********************************************************************************************************/
LW_API
ULONG  API_CpuUpMaxHetrcc (VOID)
{
#if LW_CFG_CPU_ARCH_HETRC > 0
    ULONG          i, ulMaxHetrcc = 0ul;
    PLW_CLASS_CPU  pcpu;

    LW_CPU_FOREACH_ACTIVE (i) {
        pcpu = LW_CPU_GET(i);
        if (ulMaxHetrcc < pcpu->CPU_ulHccId) {
            ulMaxHetrcc = pcpu->CPU_ulHccId;
        }
    }

    return  (ulMaxHetrcc);
#else
    return  (0ul);
#endif
}
/*********************************************************************************************************
** 函数名称: API_CpuUpCurHetrcc
** 功能描述: 获取指定异构算力簇 ID 当前激活的 CPU 数量
** 输　入  : NONE
** 输　出  : CPU 个数
** 全局变量:
** 调用模块:
                                           API 函数
*********************************************************************************************************/
LW_API
ULONG  API_CpuUpCurHetrcc (ULONG  ulHccId)
{
#if LW_CFG_CPU_ARCH_HETRC > 0
    return  (_CpuHetrccCount(ulHccId, LW_NULL));
#else
    return  (ulHccId == 0ul ? API_CpuUpNum() : 0ul);
#endif
}

#endif                                                                  /*  LW_CFG_SMP_EN > 0           */
/*********************************************************************************************************
  END
*********************************************************************************************************/
