/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: bspSmp.c
**
** 创   建   人: Han.hui (韩辉)
**
** 文件创建日期: 2023 年 06 月 09 日
**
** 描        述: 处理器需要为 SylixOS 提供的功能支持.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "SylixOS.h"
/*********************************************************************************************************
** 函数名称: bspCpuLogic2Hetrcc
** 功能描述: 获得逻辑 CPU 的算力簇 (Heterogeneous Computing Cluster) ID
** 输  入  : ulCPUId      目标 CPU
** 输  出  : 算力簇 ID (从 0 开始连续的数字, 数字大小不超过 CPU ID, 编号越大算力越强)
** 全局变量:
** 调用模块:
*********************************************************************************************************/
#if LW_CFG_CPU_ARCH_HETRC > 0

LW_WEAK ULONG  bspCpuLogic2Hetrcc (ULONG  ulCPUId)
{
    return  (0ul);                                                      /*  默认为同一算力簇            */
}

#endif                                                                  /*  LW_CFG_CPU_ARCH_HETRC > 0   */
/*********************************************************************************************************
  END
*********************************************************************************************************/
